w.edb("TR000005,TR000357,TR000356,M0061677,M0061683,M0000604,M0000606,M0000608,,,,M0001380,M0001382,M0001384,M0041339,M0041341,M0012303,M0012293,M0017126,M0068606,M0000138,M0061603", "2000-05-01", "2015-09-29","Fill=Previous")

#GDP同比数据（季度）
w.edb("M0039354", "2000-01-01", "2015-09-29","Fill=Previous")

#工业增加值（月度）、用电量、工业增加值预期
w.edb("M0000545", "2000-01-01", "2015-09-29","Fill=Previous")
w.edb("S0027013", "2000-01-01", "2015-09-29","Fill=Previous")
w.edb("M0061675", "2008-01-01", "2015-09-29","Fill=Previous")

#CPI、PPI、RPI、CPI高于预测值幅度、PPI高于预测值幅度
w.edb("M0000612", "2000-01-01", "2015-09-29","Fill=Previous")
w.edb("M0001227", "2000-01-01", "2015-09-29","Fill=Previous")
w.edb("M0001022", "2000-01-01", "2015-09-29","Fill=Previous")

#预测CPI、预测PPI、预测M2
w.edb("M0061676", "2007-12-01", "2015-09-29","Fill=Previous")
w.edb("M0061677", "2007-12-01", "2015-09-29","Fill=Previous")

















